[{"Id":"f20b2310-a62d-11ef-be78-c3e567383e5e","Title":"Dozens of Hong Kong pro-democracy activists sentenced to between quatre and dix years in prison","Text":"Dozens of prominent activists were sentenced to up to 10 years in prison on Tuesday in Hong Kong's biggest national security case under a sweeping law imposed by Beijing that crushed a once-thriving pro-democracy movement.  The defendants were prosecuted in 2021 for their roles in an unofficial primary election under the 2020 national security law. They were accused of attempting to paralyze Hong Kong's government and force the city's leader to resign by aiming to win a legislative majority and using it to block government budgets indiscriminately.  The 45 people convicted received prison terms ranging from four years and two months to 10 years. Legal scholar Benny Tai was given the longest sentence. Observers said the case illustrated how authorities suppressed dissent following huge anti-government protests in 2019, alongside media crackdowns and reduced public choice in elections. They said the drastic changes reflect how Beijing's promise to retain the former British colony's civil liberties for 50 years when it returned to China in 1997 is increasingly threadbare.   Beijing and Hong Kong governments insist the law is necessary for the city's stability.  The subversion case involves pro-democracy activists across the spectrum. Most of them had already been detained for more than three and a half years before the sentencing.  Some activists remorseful, others defiant As they pleaded for lesser sentences, some activists were remorseful and apologized, while others remained defiant.","Category":"World","Image":"f20b4a20-a62d-11ef-be78-c3e567383e5e.avif","Creation":1731990009845},{"Id":"16adfe30-a62f-11ef-8044-2f2c01103a48","Title":"FBI says bigoted texts sent to Latino, 2SLGBTQ+ Americans mentioned deportation and 're-education camps'","Text":"The U.S. Federal Bureau of Investigation said on Friday that a spate of offensive text messages sent out in the wake of Donald Trump's victory in the Nov. 5 presidential election and apparently aimed at Black Americans had expanded to target Latino and 2SLGBTQ+ people.  In a statement, the bureau said it was aware of the messages, many of which used ethnic slurs and instructed the recipients to pick cotton, a reference to past enslavement of Black people in the United States.  The FBI said on Friday that a new wave of messages was sent to Latinos and 2SLGBTQ+ people, and that \"some recipients reported being told they were selected for deportation or to report to a re-education camp.\" The texts, some of which referenced Trump's election win, drew widespread revulsion after several recipients shared them on social media last week. The Trump campaign has said it has nothing to do with the messages.  Trump, a Republican, beat out Democratic candidate Kamala Harris in the presidential race, winning the popular vote and the electoral college and capturing all seven swing states, which had been expected to be tightly fought contests. Republicans also won control of the U.S. Senate and retained control of the House.  Both federal and state authorities have said they are investigating the recent text messages. They have not said anything about who might be behind them or how many people have received them.  Trump, who takes office on Jan. 20, 2025, has pledged to end federal diversity and inclusion programs, and that has prompted fears among some Black Americans that they could soon be facing a rollback of some civil rights.","Category":"World","Image":"16ae2540-a62f-11ef-8044-2f2c01103a48.avif","Creation":1731990627416},{"Id":"38012e90-a62f-11ef-8044-2f2c01103a48","Title":"Deadly E. coli outbreak linked to organic carrots sold in U.S., Canada, officials say","Text":"One person has died in an E. coli outbreak that has sickened dozens of people who ate organic carrots that were sold in Canada and the U.S., according to the U.S. Food and Drug Administration (FDA).  The U.S. Centers for Disease Control and Prevention (CDC) said at least 39 people were ill with E. coli infections, including 15 hospitalizations, linked to fresh carrots sold by several large grocery retailers in 18 states. The Public Health Agency of Canada said it has not identified any cases regarding the recalled product in Canada.  The CDC said in a statement that the infections are linked to whole bagged carrots and baby carrots sold by Grimmway Farms in California at retailers including Walmart, Target, Kroger, Whole Foods and Trader Joe's, among other stores.  The baby carrot brands include 365, Bunny Luv, Cal-Organic, Compliments, Grimmway Farms, O-Organic, President's Choice, Trader Joe's, Wegmans and others. Whole, organic carrot brands are also under recall, the FDA said.   On Monday, the Canadian Food Inspection Agency posted a recall notice for organic carrots.  E. coli contamination of veggies harder to control than beef, experts say Why E. coli linked to romaine lettuce remains 'an extremely difficult problem' The recalled whole carrots were sold between Aug. 14 and Oct. 23. The recalled baby carrots had best-if-used-by dates ranging from Sept. 11 through Nov. 12.  The carrots are unlikely to still be on store shelves, the CDC said, but may still be in the homes of consumers and should be thrown away.  The U.S. Food and Drug Administration said on Saturday that Grimmway Farms had issued a voluntary recall of the carrots, which were also shipped to stores in Canada and Puerto Rico.","Category":"Health","Image":"38012e91-a62f-11ef-8044-2f2c01103a48.avif","Creation":1731990689704},{"Id":"2af7d220-a630-11ef-9951-4bb75fb99da7","Title":"The National | Alleged Iranian plot to kill Irwin Cotler","Text":"Nov. 18, 2024 | The RCMP foils an alleged Iranian plot to assassinate former justice minister Irwin Cotler. Russia bombards Ukraine and warns the U.S. not to escalate the war. And what happens when someone uses AI to turn your online images into nudes?","Category":"Live","Image":"2af7f930-a630-11ef-9951-4bb75fb99da7.jpeg","Creation":1731991055494}]