[{"Id":"f20b2310-a62d-11ef-be78-c3e567383e5e","Title":"Dozens of Hong Kong pro-democracy activists sentenced to between quatre and dix years in prison","Text":"Dozens of prominent activists were sentenced to up to 10 years in prison on Tuesday in Hong Kong's biggest national security case under a sweeping law imposed by Beijing that crushed a once-thriving pro-democracy movement.  The defendants were prosecuted in 2021 for their roles in an unofficial primary election under the 2020 national security law. They were accused of attempting to paralyze Hong Kong's government and force the city's leader to resign by aiming to win a legislative majority and using it to block government budgets indiscriminately.  The 45 people convicted received prison terms ranging from four years and two months to 10 years. Legal scholar Benny Tai was given the longest sentence. Observers said the case illustrated how authorities suppressed dissent following huge anti-government protests in 2019, alongside media crackdowns and reduced public choice in elections. They said the drastic changes reflect how Beijing's promise to retain the former British colony's civil liberties for 50 years when it returned to China in 1997 is increasingly threadbare.   Beijing and Hong Kong governments insist the law is necessary for the city's stability.  The subversion case involves pro-democracy activists across the spectrum. Most of them had already been detained for more than three and a half years before the sentencing.  Some activists remorseful, others defiant As they pleaded for lesser sentences, some activists were remorseful and apologized, while others remained defiant.","Category":"World","Image":"f20b4a20-a62d-11ef-be78-c3e567383e5e.avif","Creation":1731990009845},{"Id":"16adfe30-a62f-11ef-8044-2f2c01103a48","Title":"FBI says bigoted texts sent to Latino, 2SLGBTQ+ Americans mentioned deportation and 're-education camps'","Text":"The U.S. Federal Bureau of Investigation said on Friday that a spate of offensive text messages sent out in the wake of Donald Trump's victory in the Nov. 5 presidential election and apparently aimed at Black Americans had expanded to target Latino and 2SLGBTQ+ people.  In a statement, the bureau said it was aware of the messages, many of which used ethnic slurs and instructed the recipients to pick cotton, a reference to past enslavement of Black people in the United States.  The FBI said on Friday that a new wave of messages was sent to Latinos and 2SLGBTQ+ people, and that \"some recipients reported being told they were selected for deportation or to report to a re-education camp.\" The texts, some of which referenced Trump's election win, drew widespread revulsion after several recipients shared them on social media last week. The Trump campaign has said it has nothing to do with the messages.  Trump, a Republican, beat out Democratic candidate Kamala Harris in the presidential race, winning the popular vote and the electoral college and capturing all seven swing states, which had been expected to be tightly fought contests. Republicans also won control of the U.S. Senate and retained control of the House.  Both federal and state authorities have said they are investigating the recent text messages. They have not said anything about who might be behind them or how many people have received them.  Trump, who takes office on Jan. 20, 2025, has pledged to end federal diversity and inclusion programs, and that has prompted fears among some Black Americans that they could soon be facing a rollback of some civil rights.","Category":"World","Image":"16ae2540-a62f-11ef-8044-2f2c01103a48.avif","Creation":1731990627416},{"Id":"38012e90-a62f-11ef-8044-2f2c01103a48","Title":"Deadly E. coli outbreak linked to organic carrots sold in U.S., Canada, officials say","Text":"One person has died in an E. coli outbreak that has sickened dozens of people who ate organic carrots that were sold in Canada and the U.S., according to the U.S. Food and Drug Administration (FDA).  The U.S. Centers for Disease Control and Prevention (CDC) said at least 39 people were ill with E. coli infections, including 15 hospitalizations, linked to fresh carrots sold by several large grocery retailers in 18 states. The Public Health Agency of Canada said it has not identified any cases regarding the recalled product in Canada.  The CDC said in a statement that the infections are linked to whole bagged carrots and baby carrots sold by Grimmway Farms in California at retailers including Walmart, Target, Kroger, Whole Foods and Trader Joe's, among other stores.  The baby carrot brands include 365, Bunny Luv, Cal-Organic, Compliments, Grimmway Farms, O-Organic, President's Choice, Trader Joe's, Wegmans and others. Whole, organic carrot brands are also under recall, the FDA said.   On Monday, the Canadian Food Inspection Agency posted a recall notice for organic carrots.  E. coli contamination of veggies harder to control than beef, experts say Why E. coli linked to romaine lettuce remains 'an extremely difficult problem' The recalled whole carrots were sold between Aug. 14 and Oct. 23. The recalled baby carrots had best-if-used-by dates ranging from Sept. 11 through Nov. 12.  The carrots are unlikely to still be on store shelves, the CDC said, but may still be in the homes of consumers and should be thrown away.  The U.S. Food and Drug Administration said on Saturday that Grimmway Farms had issued a voluntary recall of the carrots, which were also shipped to stores in Canada and Puerto Rico.","Category":"Health","Image":"38012e91-a62f-11ef-8044-2f2c01103a48.avif","Creation":1731990689704},{"Id":"2af7d220-a630-11ef-9951-4bb75fb99da7","Title":"The National | Alleged Iranian plot to kill Irwin Cotler","Text":"Nov. 18, 2024 | The RCMP foils an alleged Iranian plot to assassinate former justice minister Irwin Cotler. Russia bombards Ukraine and warns the U.S. not to escalate the war. And what happens when someone uses AI to turn your online images into nudes?","Category":"Live","Image":"2af7f930-a630-11ef-9951-4bb75fb99da7.jpeg","Creation":1731991055494},{"Id":"7c967c20-a631-11ef-b4ec-5fdb67c6a700","Title":"Canada's rising youth unemployment could cost the country billions, report says","Text":"More than 850,000 Canadians under the age of 29 are unemployed and without any post-secondary education or training, which could cost the country billions in the future.  The information you need to know, sent directly to you: Download the CTV News App A new report from Deloitte(opens in a new tab), which was commissioned by the King’s Trust Canada(opens in a new tab), says youth unemployment in Canada reached a high of 14.5 per cent in August, the most it’s been in a decade.  Advertisement  King's Trust CEO Farah Mohamed spoke with CTV's Your Morning on Monday to discuss the figures from the report, which she called \"troubling.\"   RELATED STORIES October inflation expected to show mild bump up despite longer-term downward trend Financial strategies for Canadians facing job loss 'Not seeing a lot of new jobs': New snapshot on Alberta's economy “We need to really get young people working and we’re just not seeing that kind of traction,” Mohamed said.  The unemployment rate for rate for Canadians between 18 and 24 in October was 12.8 per cent, according to Statistics Canada, more than double the rate of 5.4 per cent for Canadians older than 25.  Mohamed says there are several reasons for the disparity.  “There’s fewer jobs. We’re not having young people be hired in a way that makes sense,” Mohamed said, adding that expectations from employers have grown, but wages have not.  “A young person needs to have three years of employment experience, a graduate degree, bilingual … and they want to be paying this person $20 an hour,” Mohamed said. “So, it’s not really a place where we’re actually cultivating young people wanting to get jobs.”  Top business headlines, all in one place The report suggests that a reduction in youth employment could result in an $18.5-billion dollar loss in GDP and more than $5 billion in losses of revenue for the Canadian government.  Mohamed says the problem affects racialized populations and those with disabilities the most. She says there isn’t enough data to determine the cause, but there are things that can be done, including government incentives to hire youth facing barriers.  Mohamed says corporations need to be part of the solution too, adding that entry-level positions need to be accessible without unreasonable qualifications.  “We have to figure out, what are the barriers that we are putting in front of people?” Mohamed said. “It’s important for young people to support themselves.”   You can watch Mohamed’s interview with CTV’s Your Morning at the top of the article","Category":"Canada","Image":"7c96ca40-a631-11ef-b4ec-5fdb67c6a700.jpeg","Creation":1731991645171},{"Id":"ac148910-a631-11ef-b4ec-5fdb67c6a700","Title":"B.C. RCMP detachment refutes social media claims of human trafficking, kidnapping","Text":"Mounties in B.C.'s Sea to Sky region say there is \"no credible evidence\" to support claims circulating on social media that a human trafficking ring is operating in Squamish or that there have been kidnappings in the community.  In a media release Monday, the detachment addressed multiple allegations posted to social media and provided information about its investigation into the alarming posts.   Advertisement  \"These kinds of posts can quickly escalate tensions, misinform the public, and put innocent people at risk. If you’re concerned about a person’s actions or suspect criminal activity, the best course of action is to report it directly to the police,\" a Squamish RCMP spokesperson wrote in a statement.  Authorities say they have found no evidence of kidnappings or attempted kidnappings and no evidence of a gang-related human trafficking ring, adding that no reports from victims of these crimes have been received.  RELATED STORIES RCMP warn against vigilantism in Squamish, B.C., as concerns circulate online Posts police describe as \"targeting\" a particular person and their vehicle have also been looked into, as have claims that an ace of spades decal on a car is linked to gangs or criminal activity.  \"Social media can be a powerful communication tool, but it also has the potential to spread misinformation that can lead to unnecessary fear within the community,” the statement from the RCMP continues.  Anyone with additional information or questions can call the detachment at 604-892-6100.  Monday's statement follows one issued last week, seemingly in response to the same social media posts, in which the detachment warned against vigilantism and said there was no threat to public safety.","Category":"Canada","Image":"ac148911-a631-11ef-b4ec-5fdb67c6a700.jpeg","Creation":1731991735899},{"Id":"d5b98bd0-a631-11ef-b4ec-5fdb67c6a700","Title":"Halifax police say Walmart employee's death isn't suspicious, refuse to release details","Text":"Police in Halifax say the death of a Walmart employee who was found inside an oven in the store last month is not suspicious, but they are refusing to release any additional details.  Halifax Regional Police responded to a sudden death(opens in a new tab) at the Walmart on Mumford Road on Oct. 19.  Police previously confirmed the 19-year-old female employee was found dead inside a large walk-in oven(opens in a new tab) in the bakery department, but have mostly remained tight-lipped about the case.  They released an update Monday, stating the woman's death is not believed to be suspicious, and there is no evidence of foul play.","Category":"Canada","Image":"d5b9d9f0-a631-11ef-b4ec-5fdb67c6a700.jpeg","Creation":1731991817066},{"Id":"ee59b700-a631-11ef-b4ec-5fdb67c6a700","Title":"Men from Ontario, B.C. charged in 'mistaken identity' shooting, RCMP say","Text":"Two men from Ontario and British Columbia have been charged in connection with a 2022 shooting that left an innocent victim seriously wounded.","Category":"Police","Image":"ee59de10-a631-11ef-b4ec-5fdb67c6a700.jpeg","Creation":1731991860422},{"Id":"296b7ae0-a632-11ef-b4ec-5fdb67c6a700","Title":"Opposing plans to end Ukraine-Russia war could clash at G20 summit","Text":"Support for Ukraine will be tested at the G20 summit as nations clash over whether they should continue offering military support for Kyiv or impose a truce on a conflict which began with Russia's invasion nearly three years ago.  The debate will pit the ceasefire aims of G20 host nation Brazil, as well as China, against the leaders of the Group of Seven, the globe's most powerful democratic nations.","Category":"World","Image":"296ba1f0-a632-11ef-b4ec-5fdb67c6a700.jpeg","Creation":1731991957969},{"Id":"6003eba0-a632-11ef-b4ec-5fdb67c6a700","Title":"Pedestrian hospitalized following crash in Port Coquitlam","Text":"One person is in hospital after being struck by a vehicle in Port Coquitlam on Sunday.  Coquitlam RCMP responded to a crash at the intersection of Lougheed Highway and Hasting Street at around 5 p.m., Nov. 17, said Mounties in a statement on Monday.   Advertisement  One person who was transported to hospital remains in a serious condition, it said.  According to police, the driver of the car remained at the scene to speak with police. Alcohol and drugs are not believed to be involved in the incident.  RELATED STORIES Man killed in group fight outside Surrey business Men from Ontario, B.C. charged in 'mistaken identity' shooting, RCMP say B.C. RCMP detachment refutes social media claims of human trafficking, kidnapping “Police wish to thank the witnesses who remained on scene while our frontline officers arrived,” said the statement.  Anyone with further information, whether eyewitness accounts or dashcam video of the area around the time of the incident, is asked to contact the","Category":"Police","Image":"600487e0-a632-11ef-b4ec-5fdb67c6a700.png","Creation":1731992057403},{"Id":"b6a9c650-a632-11ef-b4ec-5fdb67c6a700","Title":"Thief steals disabled 15-year-old dog's wheelchair","Text":"Englewood, Colo. - Caring for a senior pet is no walk in the park, especially when the pet can't walk at all. A Colorado woman was shocked to find her dog's wheelchair missing from the porch Tuesday morning. Who would steal from an old, good boy? Megan Caligiuri, of Englewood, has owned Griff, a rescued schnauzer mix, for nearly 15 years. The pair have always been active, traveling the country and doing 10-mile hikes. Trips got shorter as Griff's mobility went with age.","Category":"Live","Image":"b6a9ed60-a632-11ef-b4ec-5fdb67c6a700.jpeg","Creation":1731992191891},{"Id":"cda716f0-a632-11ef-b4ec-5fdb67c6a700","Title":"NHL referee Mitch Dunning communicative, can move extremities following violent collision","Text":"Manson skated alone on the ice when he slammed into Dunning early in the first period. Dunning went down in a heap and lay prone on the ice for several minutes. Dunning appeared to be moving his feet and moved his right hand when Manson went to talk to him.  The game was delayed for several minutes while trainers and medical staff tended to Dunning.  Dunning is a former professional hockey defenseman who played parts of three seasons in the OHL. He later shifted into officiating and was promoted to full-time NHL status in 2022.  The game continued with one referee and two linespersons.","Category":"Sports","Image":"cda76510-a632-11ef-b4ec-5fdb67c6a700.jpeg","Creation":1731992241729},{"Id":"e2dcc6f0-a632-11ef-b4ec-5fdb67c6a700","Title":"Dave Coulier debuts shaved head with a little help from his friend John Stamos","Text":"As Dave Coulier continues to go through cancer treatment, he is getting some support from his friend John Stamos.  Coulier debuted his newly shaved head in a photo posted to his “Fuller House” co-star’s Instagram page on Monday, five days after he publicly shared that he was recently diagnosed with stage 3 non-Hodgkin lymphoma, a blood cancer.","Category":"Sports","Image":"e2dd8a40-a632-11ef-b4ec-5fdb67c6a700.png","Creation":1731992277409},{"Id":"1dc92880-a633-11ef-b4ec-5fdb67c6a700","Title":"Parts of Canada will see up to 30 centimetres of snow. Here's where","Text":"CTV Your Morning's meteorologist Kelsey McEwen said the Texas low coming from the south is prompting these winter storm conditions.  A strong low-pressure system approaching from the south will bring freezing rain, between 15 and 30 centimetres of snow, and strong winds of up to 80 km/h to these areas from Monday through Wednesday.  Rain and freezing rain may turn to snow as colder air gets into the system. Strong wind gusts will result in very poor visibility in snow and blowing snow, Environment Canada said. The weather agency added that travel is expected to be hazardous due to reduced visibility in some areas.  Environment Canada warned that snowfall will mostly occur over higher terrain in western Manitoba and eastern Saskatchewan.  Areas like Cumberland House, Sask., and along Highway 106, also known as Hanson Lake Road, will see between 20 and 30 centimetres of snow.  McEwen said it has been an incredibly dry fall across the Prairies, and cities like Calgary have not seen their typical November snowfall.  \"Today's snow is extremely helpful in replenishing some of that,\"","Category":"World","Image":"1dc976a0-a633-11ef-b4ec-5fdb67c6a700.jpeg","Creation":1731992369358},{"Id":"40b80780-a633-11ef-b4ec-5fdb67c6a700","Title":"Sean 'Diddy' Combs lawyers claim seizure of writings from cell is 'outrageous government conduct'","Text":"New York - Lawyers for Sean ‘Diddy’ Combs accused prosecutors on Monday of engaging in “outrageous government conduct” by using materials seized from his jail cell to try to keep him incarcerated before a May trial. They said information gathered in a raid on Combs' cell at the Metropolitan Detention Center in Brooklyn were cited in papers the government filed in Manhattan federal court on Friday in a bid to keep the music mogul locked up before his May 5 trial.","Category":"World","Image":"40b80781-a633-11ef-b4ec-5fdb67c6a700.jpeg","Creation":1731992432289}]